InformationRegisters/МашиночитаемыеДоверенностиЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>МашиночитаемыеДоверенностиЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МЧД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МашиночитаемыеДоверенностиЭД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет МЧД к подписанному объекту
// 
// Параметры:
//  ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект - Ссылка на подписанный объект
//  МЧД  - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций, СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов - Ссылка на МЧД
//  
Процедура ДобавитьМЧД(ПодписанныйОбъект, МЧД) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.МашиночитаемыеДоверенностиЭД.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЭлектронныйДокумент = ПодписанныйОбъект;
	МенеджерЗаписи.МЧД = МЧД;
	МенеджерЗаписи.Записать();	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
